<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Description" data-toc-modified-id="Description-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Description</a></span></li><li><span><a href="#Imports" data-toc-modified-id="Imports-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Get-the-database-config" data-toc-modified-id="Get-the-database-config-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Get the database config</a></span></li><li><span><a href="#Load-sql-magic" data-toc-modified-id="Load-sql-magic-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Load sql magic</a></span></li><li><span><a href="#Get-names-of-all-tables" data-toc-modified-id="Get-names-of-all-tables-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Get names of all tables</a></span></li><li><span><a href="#Connect-the-mysql-server" data-toc-modified-id="Connect-the-mysql-server-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Connect the mysql server</a></span></li><li><span><a href="#Table-Creation-Exercises" data-toc-modified-id="Table-Creation-Exercises-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Table Creation Exercises</a></span><ul class="toc-item"><li><span><a href="#ex-1" data-toc-modified-id="ex-1-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>ex 1</a></span></li><li><span><a href="#Exercise-2" data-toc-modified-id="Exercise-2-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Exercise 2</a></span></li><li><span><a href="#INNER-JOIN" data-toc-modified-id="INNER-JOIN-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>INNER JOIN</a></span></li></ul></li><li><span><a href="#Avoid-1055-error" data-toc-modified-id="Avoid-1055-error-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Avoid 1055 error</a></span><ul class="toc-item"><li><span><a href="#Duplicate-rows" data-toc-modified-id="Duplicate-rows-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Duplicate rows</a></span></li></ul></li><li><span><a href="#Left-Join" data-toc-modified-id="Left-Join-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Left Join</a></span><ul class="toc-item"><li><span><a href="#Exercise" data-toc-modified-id="Exercise-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Exercise</a></span></li><li><span><a href="#JOIN-and-WHERE" data-toc-modified-id="JOIN-and-WHERE-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>JOIN and WHERE</a></span></li><li><span><a href="#CROSS-JOIN" data-toc-modified-id="CROSS-JOIN-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>CROSS JOIN</a></span><ul class="toc-item"><li><span><a href="#Exercise-2:" data-toc-modified-id="Exercise-2:-9.3.1"><span class="toc-item-num">9.3.1&nbsp;&nbsp;</span>Exercise 2:</a></span></li></ul></li><li><span><a href="#JOIN-Tables" data-toc-modified-id="JOIN-Tables-9.4"><span class="toc-item-num">9.4&nbsp;&nbsp;</span>JOIN Tables</a></span><ul class="toc-item"><li><span><a href="#Exercise:" data-toc-modified-id="Exercise:-9.4.1"><span class="toc-item-num">9.4.1&nbsp;&nbsp;</span>Exercise:</a></span></li><li><span><a href="#Tips-and-Tricks" data-toc-modified-id="Tips-and-Tricks-9.4.2"><span class="toc-item-num">9.4.2&nbsp;&nbsp;</span>Tips and Tricks</a></span></li></ul></li><li><span><a href="#UNION-and-UNION-ALL" data-toc-modified-id="UNION-and-UNION-ALL-9.5"><span class="toc-item-num">9.5&nbsp;&nbsp;</span>UNION and UNION ALL</a></span></li></ul></li></ul></div>

# Description
**Notes**  
- Mysql is case insensitive. eg `like('m%')` and `like('M%')` are same.


Entity Relation (ER) Diagram:

![](pdf/employees_db.png)

# Imports

In [1]:
import numpy as np
import pandas as pd
import os
import json

# Get the database config

In [2]:
ifile = os.path.expanduser('~') + "/.mysql_conf.json"
with open(ifile) as fo:
    data = json.load(fo)
    
pw = data['password']

# Load sql magic

In [3]:
%load_ext sql

In [4]:
%sql mysql+mysqlconnector://bhishan:$pw@localhost/employees

'Connected: bhishan@employees'

# Get names of all tables

In [5]:
%%sql
SELECT table_name FROM information_schema.tables
WHERE table_schema = 'employees';

 * mysql+mysqlconnector://bhishan:***@localhost/employees
10 rows affected.

[('current_dept_emp',),
 ('departments',),
 ('departments_dup',),
 ('dept_emp',),
 ('dept_emp_latest_date',),
 ('dept_manager',),
 ('dept_manager_dup',),
 ('employees',),
 ('salaries',),
 ('titles',)]

# Connect the mysql server

In [6]:
import mysql.connector

conn = mysql.connector.connect(
    host='localhost',user='bhishan',passwd=pw,database='employees')

cur = conn.cursor()

# Table Creation Exercises

## ex 1
Exercise 1:

If you currently have the ‘departments_dup’ table set up, use DROP COLUMN to remove the ‘dept_manager’ column from the ‘departments_dup’ table.

Then, use CHANGE COLUMN to change the ‘dept_no’ and ‘dept_name’ columns to NULL.

(If you don’t currently have the ‘departments_dup’ table set up, create it. Let it contain two columns: dept_no and dept_name. Let the data type of dept_no be CHAR of 4, and the data type of dept_name be VARCHAR of 40. Both columns are allowed to have null values. Finally, insert the information contained in ‘departments’ into ‘departments_dup’.)

Then, insert a record whose department name is “Public Relations”.

Delete the record(s) related to department number two.

Insert two new records in the “departments_dup” table. Let their values in the “dept_no” column be “d010” and “d011”.

In [7]:
%sql select * from departments_dup limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[('d009', 'Customer Service'), ('d005', 'Development')]

In [8]:
q = """\
alter table departments_dup
change column dept_no dept_no char(4) null;
"""
cur.execute(q)

q = """\
alter table departments_dup
change column dept_name dept_name varchar(40) null;
"""
cur.execute(q)

q = """\
insert into departments_dup(dept_name)
values ('Public Relations');
"""
cur.execute(q)

q = """\
delete from departments_dup
where dept_no = 'd002';
"""
cur.execute(q)

q = """\
insert into departments_dup(dept_no)
values ('d010'), ('d011');
"""
cur.execute(q)

conn.commit()

In [9]:
%sql select * from departments_dup;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
27 rows affected.

[('d009', 'Customer Service'),
 ('d005', 'Development'),
 ('d003', 'Human Resources'),
 ('d001', 'Marketing'),
 ('d004', 'Production'),
 ('d006', 'Quality Management'),
 ('d008', 'Research'),
 ('d007', 'Sales'),
 (None, 'Public Relations'),
 ('d010', None),
 ('d011', None),
 (None, 'Public Relations'),
 ('d010', None),
 ('d011', None),
 (None, 'Public Relations'),
 ('d010', None),
 ('d011', None),
 (None, 'Public Relations'),
 ('d010', None),
 ('d011', None),
 (None, 'Public Relations'),
 ('d010', None),
 ('d011', None),
 ('d003', 'Customer Service'),
 (None, 'Public Relations'),
 ('d010', None),
 ('d011', None)]

## Exercise 2
Exercise 2:

Create and fill in the ‘dept_manager_dup’ table, using the following code:



DROP TABLE IF EXISTS dept_manager_dup;

CREATE TABLE dept_manager_dup (

 emp_no int(11) NOT NULL,

 dept_no char(4) NULL,

 from_date date NOT NULL,

 to_date date NULL

 );

 

INSERT INTO dept_manager_dup

select * from dept_manager;

 

INSERT INTO dept_manager_dup (emp_no, from_date)

VALUES               (999904, '2017-01-01'),

                              (999905, '2017-01-01'),

                             (999906, '2017-01-01'),

                            (999907, '2017-01-01');

 

DELETE FROM dept_manager_dup

WHERE

   dept_no = 'd001';

   

INSERT INTO departments_dup (dept_name)

VALUES              ('Public Relations');

 

DELETE FROM departments_dup

WHERE

   dept_no = 'd002';

In [10]:
q = """\
DROP TABLE IF EXISTS dept_manager_dup;
"""
cur.execute(q)

q = """\
CREATE TABLE dept_manager_dup (

 emp_no int(11) NOT NULL,

 dept_no char(4) NULL,

 from_date date NOT NULL,

 to_date date NULL

 );
"""
cur.execute(q)

q = """\
INSERT INTO dept_manager_dup

select * from dept_manager;
"""
cur.execute(q)

q = """\
INSERT INTO dept_manager_dup (emp_no, from_date)

VALUES               (999904, '2017-01-01'),

                              (999905, '2017-01-01'),

                             (999906, '2017-01-01'),

                            (999907, '2017-01-01');
"""
cur.execute(q)

q = """\
DELETE FROM dept_manager_dup

WHERE

   dept_no = 'd001';
"""
cur.execute(q)

conn.commit()

In [11]:
%sql  select * from dept_manager_dup;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
26 rows affected.

[(110085, 'd002', datetime.date(1985, 1, 1), datetime.date(1989, 12, 17)),
 (110114, 'd002', datetime.date(1989, 12, 17), datetime.date(9999, 1, 1)),
 (110183, 'd003', datetime.date(1985, 1, 1), datetime.date(1992, 3, 21)),
 (110228, 'd003', datetime.date(1992, 3, 21), datetime.date(9999, 1, 1)),
 (110303, 'd004', datetime.date(1985, 1, 1), datetime.date(1988, 9, 9)),
 (110344, 'd004', datetime.date(1988, 9, 9), datetime.date(1992, 8, 2)),
 (110386, 'd004', datetime.date(1992, 8, 2), datetime.date(1996, 8, 30)),
 (110420, 'd004', datetime.date(1996, 8, 30), datetime.date(9999, 1, 1)),
 (110511, 'd005', datetime.date(1985, 1, 1), datetime.date(1992, 4, 25)),
 (110567, 'd005', datetime.date(1992, 4, 25), datetime.date(9999, 1, 1)),
 (110725, 'd006', datetime.date(1985, 1, 1), datetime.date(1989, 5, 6)),
 (110765, 'd006', datetime.date(1989, 5, 6), datetime.date(1991, 9, 12)),
 (110800, 'd006', datetime.date(1991, 9, 12), datetime.date(1994, 6, 28)),
 (110854, 'd006', datetime.date(1994, 6, 28), datetime.date(9999, 1, 1)),
 (111035, 'd007', datetime.date(1985, 1, 1), datetime.date(1991, 3, 7)),
 (111133, 'd007', datetime.date(1991, 3, 7), datetime.date(9999, 1, 1)),
 (111400, 'd008', datetime.date(1985, 1, 1), datetime.date(1991, 4, 8)),
 (111534, 'd008', datetime.date(1991, 4, 8), datetime.date(9999, 1, 1)),
 (111692, 'd009', datetime.date(1985, 1, 1), datetime.date(1988, 10, 17)),
 (111784, 'd009', datetime.date(1988, 10, 17), datetime.date(1992, 9, 8)),
 (111877, 'd009', datetime.date(1992, 9, 8), datetime.date(1996, 1, 3)),
 (111939, 'd009', datetime.date(1996, 1, 3), datetime.date(9999, 1, 1)),
 (999904, None, datetime.date(2017, 1, 1), None),
 (999905, None, datetime.date(2017, 1, 1), None),
 (999906, None, datetime.date(2017, 1, 1), None),
 (999907, None, datetime.date(2017, 1, 1), None)]

## INNER JOIN

Extract a list containing information about all managers’ employee number, first and last name, department number, and hire date.

In [12]:
%sql select * from employees limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21))]

In [13]:
%sql select * from dept_manager limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1)),
 (110039, 'd001', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1))]

In [14]:
%%sql
select e.emp_no, e.first_name, e.last_name, dm.dept_no, e.hire_date
from employees e 
join dept_manager dm
on e.emp_no = dm.emp_no;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
24 rows affected.

[(110022, 'Margareta', 'Markovitch', 'd001', datetime.date(1985, 1, 1)),
 (110039, 'Vishwani', 'Minakawa', 'd001', datetime.date(1986, 4, 12)),
 (110085, 'Ebru', 'Alpin', 'd002', datetime.date(1985, 1, 1)),
 (110114, 'Isamu', 'Legleitner', 'd002', datetime.date(1985, 1, 14)),
 (110183, 'Shirish', 'Ossenbruggen', 'd003', datetime.date(1985, 1, 1)),
 (110228, 'Karsten', 'Sigstam', 'd003', datetime.date(1985, 8, 4)),
 (110303, 'Krassimir', 'Wegerle', 'd004', datetime.date(1985, 1, 1)),
 (110344, 'Rosine', 'Cools', 'd004', datetime.date(1985, 11, 22)),
 (110386, 'Shem', 'Kieras', 'd004', datetime.date(1988, 10, 14)),
 (110420, 'Oscar', 'Ghazalie', 'd004', datetime.date(1992, 2, 5)),
 (110511, 'DeForest', 'Hagimont', 'd005', datetime.date(1985, 1, 1)),
 (110567, 'Leon', 'DasSarma', 'd005', datetime.date(1986, 10, 21)),
 (110725, 'Peternela', 'Onuegbe', 'd006', datetime.date(1985, 1, 1)),
 (110765, 'Rutger', 'Hofmeyr', 'd006', datetime.date(1989, 1, 7)),
 (110800, 'Sanjoy', 'Quadeer', 'd006', datetime.date(1986, 8, 12)),
 (110854, 'Dung', 'Pesch', 'd006', datetime.date(1989, 6, 9)),
 (111035, 'Przemyslawa', 'Kaelbling', 'd007', datetime.date(1985, 1, 1)),
 (111133, 'Hauke', 'Zhang', 'd007', datetime.date(1986, 12, 30)),
 (111400, 'Arie', 'Staelin', 'd008', datetime.date(1985, 1, 1)),
 (111534, 'Hilary', 'Kambil', 'd008', datetime.date(1988, 1, 31)),
 (111692, 'Tonny', 'Butterworth', 'd009', datetime.date(1985, 1, 1)),
 (111784, 'Marjo', 'Giarratana', 'd009', datetime.date(1988, 2, 12)),
 (111877, 'Xiaobin', 'Spinelli', 'd009', datetime.date(1991, 8, 17)),
 (111939, 'Yuchang', 'Weedman', 'd009', datetime.date(1989, 7, 10))]

# Avoid 1055 error

In [15]:
q = "set @@global.sql_mode := replace(@@global.sql_mode, 'ONLY_FULL_GROUP_BY', '');"
cur.execute(q)
conn.commit()

## Duplicate rows
To avoid the problem of duplicate rows, first know which field has most duplicates, lets say there are many rows duplicated with 'emp_no', then group by it.

In [16]:
q = """\
insert into dept_manager_dup
values ('110228','d003','1992-03-21','9999-01-01');
""";
cur.execute(q)

q = """\
insert into departments_dup
values ('d003','Customer Service');
""";
cur.execute(q)

conn.commit()

In [42]:
%%sql
select m.dept_no, m.emp_no, d.dept_name
from dept_manager_dup m
join departments_dup d
on m.dept_no = d.dept_no
order by dept_no
limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[('d003', 110228, 'Customer Service'), ('d003', 110183, 'Human Resources')]

In [41]:
%%sql
select m.dept_no, m.emp_no, d.dept_name
from dept_manager_dup m
join departments_dup d
on m.dept_no = d.dept_no
group by m.emp_no
order by dept_no
limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[('d003', 110183, 'Human Resources'), ('d003', 110228, 'Human Resources')]

# Left Join

## Exercise
Join the 'employees' and the 'dept_manager' tables to return a subset of all the employees whose last name is Markovitch. See if the output contains a manager with that name.  

Hint: Create an output containing information corresponding to the following fields: ‘emp_no’, ‘first_name’, ‘last_name’, ‘dept_no’, ‘from_date’. Order by 'dept_no' descending, and then by 'emp_no'.

In [26]:
%sql select * from employees limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21))]

In [28]:
%sql select * from dept_manager limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1)),
 (110039, 'd001', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1))]

In [30]:
%%sql
SELECT e.emp_no,
       e.first_name,
       e.last_name,
       dm.dept_no,
       dm.from_date
FROM employees e
LEFT JOIN dept_manager dm ON e.emp_no = dm.emp_no
WHERE e.last_name = 'Markovitch'
ORDER BY dm.dept_no DESC,
         e.emp_no
LIMIT 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(110022, 'Margareta', 'Markovitch', 'd001', datetime.date(1985, 1, 1)),
 (10898, 'Munenori', 'Markovitch', None, None)]

## JOIN and WHERE
Select the first and last name, the hire date, and the job title of all employees whose first name is “Margareta” and have the last name “Markovitch”.

In [31]:
%%sql
SELECT e.first_name,
       e.last_name,
       e.hire_date,
       t.title
FROM employees e
JOIN titles t ON e.emp_no = t.emp_no
WHERE first_name = 'Margareta'
  AND last_name = 'Markovitch'
ORDER BY e.emp_no ;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[('Margareta', 'Markovitch', datetime.date(1985, 1, 1), 'Manager'),
 ('Margareta', 'Markovitch', datetime.date(1985, 1, 1), 'Senior Staff')]

## CROSS JOIN

Exercise 1:

Use a CROSS JOIN to return a list with all possible combinations between managers from the dept_manager table and department number 9.

In [36]:
%%sql
SELECT dm.*,
       d.*
FROM departments d
CROSS JOIN dept_manager dm
WHERE d.dept_no = 'd009'
ORDER BY d.dept_name
LIMIT 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1), 'd009', 'Customer Service'),
 (110039, 'd001', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1), 'd009', 'Customer Service')]

### Exercise 2:

Return a list with the first 10 employees with all the departments they can be assigned to.

Hint: Don’t use LIMIT; use a WHERE clause.

In [35]:
%%sql
SELECT e.*,
       d.*
FROM employees e
CROSS JOIN departments d
WHERE e.emp_no < 10011
ORDER BY e.emp_no,
         d.dept_name
LIMIT 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 'd009', 'Customer Service'),
 (10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26), 'd005', 'Development')]

## JOIN Tables
Select all managers’ first and last name, hire date, job title, start date, and department name.

In [40]:
%%sql
SELECT e.first_name,
       e.last_name,
       e.hire_date,
       t.title,
       m.from_date,
       d.dept_name
FROM employees e
JOIN dept_manager m ON e.emp_no = m.emp_no
JOIN departments d ON m.dept_no = d.dept_no
JOIN titles t ON e.emp_no = t.emp_no
WHERE t.title = 'Manager'
ORDER BY e.emp_no
LIMIT 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[('Margareta', 'Markovitch', datetime.date(1985, 1, 1), 'Manager', datetime.date(1985, 1, 1), 'Marketing'),
 ('Vishwani', 'Minakawa', datetime.date(1986, 4, 12), 'Manager', datetime.date(1991, 10, 1), 'Marketing')]

In [39]:
%%sql
SELECT e.first_name,
       e.last_name,
       e.hire_date,
       t.title,
       m.from_date,
       d.dept_name
FROM employees e
JOIN dept_manager m ON e.emp_no = m.emp_no
JOIN departments d ON m.dept_no = d.dept_no
JOIN titles t ON e.emp_no = t.emp_no
AND m.from_date = t.from_date
ORDER BY e.emp_no
LIMIT 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[('Margareta', 'Markovitch', datetime.date(1985, 1, 1), 'Manager', datetime.date(1985, 1, 1), 'Marketing'),
 ('Vishwani', 'Minakawa', datetime.date(1986, 4, 12), 'Manager', datetime.date(1991, 10, 1), 'Marketing')]

### Exercise:

How many male and how many female managers do we have in the ‘employees’ database?

In [43]:
%%sql
SELECT e.gender,
       COUNT(dm.emp_no)
FROM employees e
JOIN dept_manager dm ON e.emp_no = dm.emp_no
GROUP BY gender;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[('M', 11), ('F', 13)]

### Tips and Tricks

In [51]:
%%sql
select d.dept_name, avg(s.salary) as avg_salary
from departments d
join dept_manager dm ON d.dept_no = dm.dept_no
join salaries s on dm.emp_no = s.emp_no
group by d.dept_name
having avg_salary > 60000
order by avg_salary desc;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
5 rows affected.

[('Marketing', Decimal('88371.6857')),
 ('Sales', Decimal('85738.7647')),
 ('Research', Decimal('77535.1818')),
 ('Finance', Decimal('70815.8889')),
 ('Quality Management', Decimal('67130.9355'))]

## UNION and UNION ALL

In [55]:
%%sql
select * from employees limit 1;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
1 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26))]

In [56]:
%%sql
select * from dept_manager limit 1;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
1 rows affected.

[(110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1))]

In [53]:
%%sql
SELECT *
FROM
  (SELECT e.emp_no,
          e.first_name,
          e.last_name,
          NULL AS dept_no,
          NULL AS from_date
       FROM employees e
       WHERE last_name = 'Denis'
       UNION 
       SELECT   NULL AS emp_no,
                NULL AS first_name,
                NULL AS last_name,
                dm.dept_no,
                dm.from_date
           FROM dept_manager dm
  ) AS a
ORDER BY -a.emp_no DESC
LIMIT 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(13009, 'Marc', 'Denis', None, None), (13072, 'Jaques', 'Denis', None, None)]